#include <locale.h>
#include <stdio.h>

void main()
{
	setlocale(LC_ALL, "RUS");
	printf("%20s\n", "Это текст");
	printf("\t");
	printf("0s\n", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	printf("Умножение %d на %d равен %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %d\n", 5., 2., 5. / 2.);
	printf("%g разделить %e равно %f\n", 5., 2., 5. / 2.);
	printf("%g разделить %e равно %g\n", 5., 2., 5. / 2.);
	printf("%g разделить %e равно %e\n", 5., 2., 5. / 2.);
	int N = 20, K = 25;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K, "00");
	printf("Идёт %d минут\n, K");
	printf("До полуночи осталось %d часов и %d минут\n", N, K);
	printf("с 8:00 прошло %d секунд\n", (N - 8) * 3600 + K);
	printf("Текущий час = %f суток и текущая минута = %f часа\n\n", N / 24., K / 60.);
	printf("Дано:\n%12d\n%12d\n\t__________\nРезультат:\n\t%+03.3f", 3, 333, 3. / 333);
	getchar();
}
